rofiqcp/agv/stm32f401/src/main.cpp
// ============================================================================
// ADV HMI Firmware — STM32F411CEU6 + ILI9341 320x240 + XPT2046
// Final UI architecture: HOME / CAMERA / GPS / ACTUATOR
// ============================================================================

#include <Arduino.h>
#include <SPI.h>
#include <TFT_eSPI.h>
#include <math.h>
#include <string.h>
#include <stdlib.h>

// STM32F411 ROM bootloader support for firmware updates over the same USB connector.
#include <stm32f4xx_hal.h>

#include "Config.h"
#include "Telemetry.h"
#include "Neo3Sensors.h"
#include "VescGateway.h"
#include "Theme.h"
#include "Icons.h"
#include "SplashScreen.h"
#include "HomePage.h"
#include "CameraPage.h"
#include "GpsPage.h"
#include "ActuatorPage.h"
#include "TouchButtons.h"

#ifndef HMI_LEGACY_UART
#define HMI_LEGACY_UART 0
#endif

TFT_eSPI tft = TFT_eSPI();
VehicleTelemetry gTelemetry = defaultTelemetry();
Neo3Sensors gNeo3;
VescGateway gVesc;

static PageId currentPage = PAGE_SPLASH;
static CameraSubPage currentCameraTab = CAM_VIEW;
static bool splashComplete = false;
static uint8_t splashProgress = 0;
static bool splashReadyText = false;
static uint32_t splashStartMs = 0;
static uint32_t splashReadyMs = 0;
static uint32_t lastFrameMs = 0;

static bool uiDirty = false;
static uint32_t lastUiRefreshMs = 0;
static uint32_t lastRosHeartbeatMs = 0;
static uint32_t lastTouchPollMs = 0;
static uint8_t rosHeartbeatStableCount = 0;
static bool rosHeartbeatStable = false;

// Latched manual-control state. A single tap starts/changes the command;
// releasing the finger does NOT cancel it. STOP, mode changes, faults, or
// leaving the ACTUATOR page cancel the latched drive command.
static ControlAction activeDriveControl = CTRL_NONE;   // FWD / REV / NONE
static ControlAction activeSteerControl = CTRL_NONE;   // LEFT / RIGHT / CENTER / NONE

// Long VESC config/firmware frames are transported as hexadecimal commands.
// 640 bytes safely holds a 240-byte raw chunk plus namespace/terminator.
static char serialRx[640];
static size_t serialRxLen = 0;
static bool serialRxDiscarding = false;
#if HMI_LEGACY_UART
static char serial1Rx[128];
static size_t serial1RxLen = 0;
static bool serial1RxDiscarding = false;
#endif

// ---------------------------------------------------------------------------
// Forward declarations used by page/safety helpers
// ---------------------------------------------------------------------------
static void sendDriveStop();
static void publishControlState();
static void publishCameraTab();
static void enterSystemDfu();

// ---------------------------------------------------------------------------
// USB firmware-update helper
// STM32F411 system-memory bootloader starts at 0x1FFF0000 and exposes USB DFU.
// We reset first, then jump from .preinit_array before Arduino/HAL/USB startup,
// avoiding stale USB/peripheral state during erase/program operations.
// ---------------------------------------------------------------------------
static constexpr uint32_t kSystemMemory = 0x1FFF0000UL;
static constexpr uint32_t kDfuBootMagic = 0x44465531UL;  // "DFU1"
__attribute__((section(".noinit"))) static volatile uint32_t gDfuBootMagic;

static void earlySystemDfuCheck() {
  if (gDfuBootMagic != kDfuBootMagic) return;
  gDfuBootMagic = 0;

  const uint32_t bootStack = *reinterpret_cast<volatile uint32_t*>(kSystemMemory);
  const uint32_t bootReset = *reinterpret_cast<volatile uint32_t*>(kSystemMemory + 4UL);

  // Sanity-check the ROM vectors before changing processor state.
  if ((bootStack & 0x2FFE0000UL) != 0x20000000UL ||
      (bootReset & 0xFFF00000UL) != 0x1FF00000UL) {
    return;
  }

  __disable_irq();
  SysTick->CTRL = 0;
  SysTick->LOAD = 0;
  SysTick->VAL = 0;
  for (uint32_t i = 0; i < 8; ++i) {
    NVIC->ICER[i] = 0xFFFFFFFFUL;
    NVIC->ICPR[i] = 0xFFFFFFFFUL;
  }

  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();
  SCB->VTOR = kSystemMemory;
  __DSB();
  __ISB();

  using BootEntry = void (*)();
  BootEntry boot = reinterpret_cast<BootEntry>(bootReset);
  __set_MSP(bootStack);
  __enable_irq();
  boot();
  while (true) { }
}

using PreinitFn = void (*)();
__attribute__((used, section(".preinit_array")))
static PreinitFn const gEarlyDfuHook = earlySystemDfuCheck;

static void enterSystemDfu() {
  // Finish acknowledgement and force a clean CDC disconnect before reset.
  Serial.flush();
  delay(40);
  Serial.end();
#if HMI_LEGACY_UART
  Serial1.end();
#endif
  delay(120);

  gDfuBootMagic = kDfuBootMagic;
  __DSB();
  __ISB();
  NVIC_SystemReset();
  while (true) { }
}

// ---------------------------------------------------------------------------
// Page helpers
// ---------------------------------------------------------------------------
static const char* pageName(PageId page) {
  switch (page) {
    case PAGE_SPLASH:   return "SPLASH";
    case PAGE_HOME:     return "HOME";
    case PAGE_CAMERA:   return "CAMERA";
    case PAGE_GPS:      return "GPS";
    case PAGE_ACTUATOR: return "ACTUATOR";
    default:            return "UNKNOWN";
  }
}

static void printBoth(const char* line) {
  Serial.println(line);
#if HMI_LEGACY_UART
  Serial1.println(line);
#endif
}

static void publishPage() {
  Serial.print(F("PAGE:"));
  Serial.println(pageName(currentPage));
#if HMI_LEGACY_UART
  Serial1.print(F("PAGE:"));
  Serial1.println(pageName(currentPage));
#endif
}

static const char* driveControlName() {
  if (activeDriveControl == CTRL_FORWARD) return "FWD";
  if (activeDriveControl == CTRL_REVERSE) return "REV";
  return "STOP";
}

static const char* steerControlName() {
  if (activeSteerControl == CTRL_LEFT) return "LEFT";
  if (activeSteerControl == CTRL_RIGHT) return "RIGHT";
  if (activeSteerControl == CTRL_CENTER) return "CENTER";
  return "NONE";
}

static void publishCameraTab() {
  char line[32];
  snprintf(line, sizeof(line), "CAMTAB:%s", cameraTabName(currentCameraTab));
  printBoth(line);
}

static void publishLinkState() {
  printBoth(gTelemetry.rosConnected ? "LINK:ROS:ONLINE" : "LINK:ROS:OFFLINE");
}

static void publishControlState() {
  char line[40];
  snprintf(line, sizeof(line), "MODE:%s", gTelemetry.mode == MODE_MANUAL ? "MANUAL" : "AUTO");
  printBoth(line);
  snprintf(line, sizeof(line), "CTRL:DRIVE:%s", driveControlName());
  printBoth(line);
  snprintf(line, sizeof(line), "CTRL:STEER:%s", steerControlName());
  printBoth(line);
  snprintf(line, sizeof(line), "CTRL:SPEED:%u", gTelemetry.manualSpeedPct);
  printBoth(line);
}

static void drawCurrentPage(bool fullDraw = true) {
  switch (currentPage) {
    case PAGE_HOME:
      if (fullDraw) drawHomePage(gTelemetry);
      else updateHomePage(gTelemetry);
      break;
    case PAGE_CAMERA:
      if (fullDraw) drawCameraPage(gTelemetry, currentCameraTab);
      else updateCameraPage(gTelemetry, currentCameraTab);
      break;
    case PAGE_GPS:
      if (fullDraw) drawGpsPage(gTelemetry);
      else updateGpsPage(gTelemetry);
      break;
    case PAGE_ACTUATOR:
      if (fullDraw) drawActuatorPage(gTelemetry, activeDriveControl, activeSteerControl);
      else updateActuatorPage(gTelemetry, activeDriveControl, activeSteerControl);
      break;
    case PAGE_SPLASH:
    default:
      break;
  }
}

static void showPage(PageId page) {
  if (page == PAGE_SPLASH) return;
  if (splashComplete && page == currentPage) {
    publishPage();
    return;
  }
  if (!splashComplete) {
    splashComplete = true;
    beginTouch();
  }

