rofiqcp/agv/stm32f401/src/main.cpp
static void pollSerialStream(Stream& io, char* rx, size_t capacity, size_t& rxLen, bool& discarding) {
  while (io.available() > 0) {
    const char c = (char)io.read();
    if (c == '\r') continue;
    if (discarding) {
      if (c == '\n') discarding = false;
      continue;
    }
    if (c == '\n') {
      rx[rxLen] = '\0';
      if (rxLen > 0) handleSerialCommand(rx);
      rxLen = 0;
    } else if (rxLen + 1U < capacity) {
      rx[rxLen++] = c;
    } else {
      rxLen = 0;
      discarding = true;
      io.println(F("ERR:COMMAND_TOO_LONG"));
    }
  }
}

static void pollSerialGui() {
  pollSerialStream(Serial, serialRx, sizeof(serialRx), serialRxLen, serialRxDiscarding);
#if HMI_LEGACY_UART
  pollSerialStream(Serial1, serial1Rx, sizeof(serial1Rx), serial1RxLen, serial1RxDiscarding);
#endif
}

// ---------------------------------------------------------------------------
// Display / splash
// ---------------------------------------------------------------------------
static void initDisplay() {
  pinMode(PIN_TOUCH_CS, OUTPUT);
  digitalWrite(PIN_TOUCH_CS, HIGH);
  tft.init();
  tft.setRotation(1);
  // RGB565 illustration arrays use standard byte order.
  tft.setSwapBytes(true);
  tft.fillScreen(C_BG);
  tft.setTextDatum(MC_DATUM);
}

static bool updateProgressBar() {
  if (splashComplete) return false;

  uint32_t now = millis();
  if (now - lastFrameMs < FRAME_MS) return true;
  lastFrameMs = now;

  uint32_t elapsed = now - splashStartMs;
  if (elapsed < PROGRESS_MS) {
    uint8_t target = (uint8_t)((elapsed * 100UL) / PROGRESS_MS);
    if (target != splashProgress) {
      splashProgress = target;
      int innerW = PB_W - 4;
      int fillW = (int)((splashProgress * innerW) / 100);
      tft.fillRoundRect(PB_X + 2, PB_Y + 2, innerW, PB_H - 4, PB_R - 2, C_BG);
      if (fillW > 0) tft.fillRoundRect(PB_X + 2, PB_Y + 2, fillW, PB_H - 4, PB_R - 2, C_ACCENT);
    }
    return true;
  }

  if (!splashReadyText) {
    splashReadyText = true;
    splashReadyMs = now;
    tft.fillRoundRect(PB_X + 2, PB_Y + 2, PB_W - 4, PB_H - 4, PB_R - 2, C_READY);
    tft.fillRect(70, 186, 180, 18, C_BG);
    drawUiText("HMI ready", W / 2, 187, C_READY, C_BG, MC_DATUM);
  }

  if (splashReadyText && now - splashReadyMs >= READY_HOLD) {
    splashComplete = true;
    beginTouch();
    if (gTelemetry.systemStatus == SYS_INITIALIZING) gTelemetry.systemStatus = SYS_NOT_READY;
    showPage(PAGE_HOME);
    return false;
  }
  return true;
}

#if HMI_DEMO_MODE
static void updateDemoTelemetry() {
  static uint32_t demoMs = 0;
  if (millis() - demoMs < 700) return;
  demoMs = millis();

  gTelemetry.systemStatus = SYS_READY;
  gTelemetry.mode = MODE_MANUAL;
  gTelemetry.state = STATE_STOPPED;
  gTelemetry.gpsReady = true;
  gTelemetry.gpsFix = GPS_3D_FIX;
  gTelemetry.latitude = -7.050123;
  gTelemetry.longitude = 110.440235;
  gTelemetry.satellites = 17;
  gTelemetry.hdop = 0.82f;
  gTelemetry.imuReady = true;
  gTelemetry.cameraReady = true;
  gTelemetry.perceptionReady = true;
  gTelemetry.cameraFps = 8.0f;
  snprintf(gTelemetry.detectedObject, sizeof(gTelemetry.detectedObject), "%s", "PERSON");
  gTelemetry.objectDistanceM = 3.24f;
  gTelemetry.drivableAreaClear = true;
  gTelemetry.obstacleDetected = false;
  gTelemetry.escReady = true;
  gTelemetry.encoderReady = true;
  gTelemetry.speedKmh = 0.0f;
  gTelemetry.headingDeg += 1.0f;
  if (gTelemetry.headingDeg >= 360.0f) gTelemetry.headingDeg = 0.0f;
  gTelemetry.steeringActualDeg = gTelemetry.steeringTargetDeg - 0.2f;
  gTelemetry.steeringErrorDeg = gTelemetry.steeringTargetDeg - gTelemetry.steeringActualDeg;
  gTelemetry.motorRpm = 328.0f;
  uiDirty = true;
}
#endif

void setup() {
  pinMode(PC13, OUTPUT);
  digitalWrite(PC13, HIGH);

  Serial.begin(115200);
#if HMI_LEGACY_UART
  Serial1.begin(115200);
#endif
  delay(50);
  Serial.println(F("ADV HMI + CUAV NEO3 integrated firmware — boot"));

  // Sensor interfaces are initialized before the splash so GNSS acquisition
  // and IST8310 conversion run in parallel with the HMI startup animation.
  gNeo3.begin();
  gVesc.begin();

  initDisplay();
  restartSplash();
}

void loop() {
  // USB host commands are serviced first. In VESC MAINTENANCE the gateway owns
  // the USB/UART bandwidth exclusively so firmware blocks cannot be dropped by
  // GNSS/I2C/TFT traffic. Power-stage outputs remain under the F103 bootloader's
  // safe-OFF policy during an update.
  pollSerialGui();
  gVesc.poll();

  // VESC traffic has first service priority, but maintenance must not suspend
  // unrelated F411 functions. GNSS, IST8310, safety I/O, touch/HMI and actuator
  // state continue to run while VESC Tool owns the motor link. This mirrors the
  // official VESC design where UART packet processing is a communication task,
  // not a global mode that blocks other application tasks.
  gNeo3.poll();
  // Cooperative equivalent of the dedicated UART thread in upstream VESC:
  // immediately drain any F103 reply that arrived while sensor work ran.
  gVesc.poll();
  pollSerialGui();
  checkRosLinkTimeout();

  if (!splashComplete) {
    updateProgressBar();
  } else {
    const uint32_t now = millis();
    if ((uint32_t)(now - lastTouchPollMs) >= TOUCH_POLL_MS) {
      lastTouchPollMs = now;
      handleTouch();
    }

#if HMI_DEMO_MODE
    updateDemoTelemetry();
#endif

    // Full-rate telemetry never means full-rate painting. Each page also caches
    // its formatted values, so only changed pixels are touched at this cadence.
    if (uiDirty && !touchWasDown && (uint32_t)(now - lastUiRefreshMs) >= DISPLAY_REFRESH_MS) {
      lastUiRefreshMs = now;
      uiDirty = false;
      drawCurrentPage(false);
    }
  }

  // Heartbeat LED (PC13 active-low on many Black Pill boards)
  static uint32_t ledMs = 0;
  if (millis() - ledMs >= 500) {
    ledMs = millis();
    digitalWrite(PC13, !digitalRead(PC13));
  }
}
